Repository: Belarus/OmegaT-Common.TMX
Catalog: tmx/non-segmented/drupal-7.x.tmx
Source language: en
Languages: be

source: <p>This site allows HTML content. While learning all of HTML may feel intimidating, learning how to use a very small number of the most basic HTML "tags" is very easy. This table provides examples for each tag that is enabled on this site.</p> <p>For more information see W3C's <a href="http://www.w3.org/TR/html/">HTML Specifications</a> or use your favorite search engine to find other sites that explain HTML.</p>
be: <p>Гэты сайт падтрымлівае ўвод HTML-матэрыялаў. Зразумела, што вывучэньне ўсяго HTML можа быць нявартым заняткам для тых, хоча проста дапісваць, але пару простых цэтлікаў запомніць досыць нескладана. У гэтае табліцы паказаныя прыклады цэтлікаў для кожнага на сайце.</p> <p>Болей за ўсё Вы можаце даведацца на старонцы <a href="http://www.w3.org/TR/html/">спэцыфікацыяў HTML W3C</a>. Можна пашукаць яшчэ іншыя сайты, дзе тлумачыцца HTML.</p>

source: <p>To display the name of a registered user, use this instead:</p> <pre> global $user; if ($user->uid) { print t('Welcome @name! Thank you for visiting.', array('@name' => format_username($user))); } else { print t('Welcome visitor! Thank you for visiting.'); } </pre>
be: <p>Каб адлюстраваць імя зарэгістраванага карыстальніка, выкарыстоўвайце гэта:</p>\r <pre>\r global $user;\r if ($user->uid) {\r print t('Сардэчна запрашаем @name! Дзякуем Вам за наведванне.', array('@name' => format_username($user)));\r }\r else {\r print t('Сардэчна запрашаем наведвальніка! Дзякуем Вам за наведванне.');\r }\r </pre>

source: <strong class="error">Set up the <a href="!file-system">public files directory</a> to make these optimizations available.</strong>
be: <strong class="error">Усталяваць <a href="!file-system">каталог публічных файлаў</a>, каб зрабіць гэтыя аптымізацыі дасяжнымі.</strong>

source: <strong>@language_name</strong> (source)
be: <strong>@language_name</strong> (крыніца)

source: <strong>Configure your website</strong> Once logged in, visit the <a href="@admin">administration section</a>, where you can <a href="@config">customize and configure</a> all aspects of your website.
be: <strong>Сканфігураваць свой вэбсайт</strong> Увайшоўшы ў рахунак, наведайце <a href="@admin">раздзел адміністравання</a>, дзе вы можаце падагнаць і сканфігураваць<a href="@config"></a> усе бакі вашага вэбсайта.

source: <strong>Customize your website design</strong> To change the "look and feel" of your website, visit the <a href="@themes">themes section</a>. You may choose from one of the included themes or download additional themes from the <a href="@download_themes">Drupal themes download section</a>.
be: <strong>Падганіце дызайн вашага вэбсайта</strong> Каб змяніць знешні выгляд вашага сайта, наведайце <a href="@themes">раздел з тэмамі</a>. Вы можаце альбо выбраць адну з ўжо ўключаных тэм, альбо спампаваць дадатковыя з <a href="@download_themes">раздзелу па запампоўцы тэм Drupal</a>.

source: <strong>Enable additional functionality</strong> Next, visit the <a href="@modules">module list</a> and enable features which suit your specific needs. You can find additional modules in the <a href="@download_modules">Drupal modules download section</a>.
be: <strong>Уключыць дадатковыя функцыянальныя магчымасці</strong> Наступным крокам наведайце <a href="@modules">спіс модуляў</a> і ўключыце функцыі, якія найбольш адпавядаюць вашым патрэбам. Вы можаце знайсці дадатковыя модулі ў <a href="@download_modules">разделе па запампоўцы модуляў Drupal</a>.

source: <strong>Start posting content</strong> Finally, you can <a href="@content">add new content</a> for your website.
be: <strong>Пачаць размяшчаць змесціва</strong> Нарэшце, вы можаце <a href="@content">дадаць новае змесціва</a>для вашага сайта.

source: <strong>Warning:</strong> There are currently @count menu links in %title. They will be deleted (system-defined links will be reset).
be: <strong>Увага:</strong> У дадзены момант ёсць @count спасылак меню ў %title. Яны будуць выдалены (вызначаныя сістэмай спасылкі будуць скінуты).

source: <sub>Sub</sub>scripted
be: <sub>Ніжні</sub> індэкс

source: <sup>Super</sup>scripted
be: <sup>Верхні</sup> індэкс

source: <ul> <li>Check if your spelling is correct.</li> <li>Remove quotes around phrases to match each word individually: <em>"blue smurf"</em> will match less than <em>blue smurf</em>.</li> <li>Consider loosening your query with <em>OR</em>: <em>blue smurf</em> will match less than <em>blue OR smurf</em>.</li> </ul>
be: <ul>\r <li>Праверце правапіс.</li>\r <li>Выдаліце двукоссі вакол фраз каб шукаць кожнае слова паасобку: на <em>&quot;чорны воўк&quot;</em> будзе знойдзена менш, чым на <em>чорны воўк</em>.</li>\r <li>Пашырце пошук з дапамогай аператара <em>OR</em>: на запыт <em>чорны воўк</em> будзе знойдзена менш, чым на запыт <em>чорны OR воўк</em>.</li>\r </ul>

source: <ul> <li>Check if your spelling is correct.</li> <li>Remove quotes around phrases to search for each word individually. <em>bike shed</em> will often show more results than <em>&quot;bike shed&quot;</em>.</li> <li>Consider loosening your query with <em>OR</em>. <em>bike OR shed</em> will often show more results than <em>bike shed</em>.</li> </ul>
be: <ul>\r <li>Праверце, што ваша напісанне правільнае.</li>\r <li>Выдаліце двухкоссі атачаючыя выразы, каб шукаць больш індывідуальна кожнае слова. <em>Кансерваваны яблык</em> часта паказвае больш вынікаў, чым <em>&quot;кансерваваны яблык&quot;</em>.</li>\r <li>Улічвайце паслабленне вашага запыту выкарыстаннем <em>OR</em>. <em>Кансерваваны OR яблык</em> дае часта больш вынікаў, чым <em>кансерваваны яблык</em>.</li>\r </ul>

source: <ul><li>To start over, you must empty your existing database.</li><li>To install to a different database, edit the appropriate <em>settings.php</em> file in the <em>sites</em> folder.</li><li>To upgrade an existing installation, proceed to the <a href="@base-url/update.php">update script</a>.</li><li>View your <a href="@base-url">existing site</a>.</li></ul>
be: <ul><li>Каб пачаць інсталяцыю спачатку, вы павінныя выдаліць дадзеныя з базы.</li><li>Каб інсталяваць сістэму ў іншую БД, памяняйце назву базы ў файле <em>settings.php</em> у дырэкторыі <em>sites</em>.</li><li>Каб правесьці апгрэйд версіі, запусціце скрыпт <a href="@base-url/update.php">update.php</a>.</li><li>Перайсці да <a href="@base-url">існуючага сайта</a>.</li></ul>

source: @backend connection settings
be: @backend параметры злучэння

source: @count bytes
be: @count байт

source: @count comments
be: @count каментары

source: @count days
be: @count дзен

source: @count debug messages
be: @count адладжаных паведамленняў

source: @count disallowed HTML string(s) in %file
be: Недапушчальная колькасць @count HTML радкоў у %file

source: @count e-mails were sent during this test.
be: Падчас гэтага тэста было адаслана @count e-mail'аў

source: @count exceptions
be: @count выключэнняў

source: @count fails
be: @count правалена

source: @count hours
be: @count гадзінаў

source: @count items
be: @count пунктаў(ы)

source: @count items successfully processed:
be: @count элементаў паспяхова апрацавана:

source: @count min
be: @count хв.

source: @count months
be: @count мес.

source: @count new
be: @count новых

source: @count new comments
be: @count новых каментараў

source: @count orphaned actions (%orphans) exist in the actions table. !link
be: @count пашкоджанных дзеянняў (%orphans) існуе ў базе дадзеных. !link

source: @count passes
be: @count пройдзена

source: @count pending updates
be: Абнаўленні колькасцю @count у чаканні

source: @count pending updates (@number_applied to be applied, @number_incompatible skipped)
be: Абнаўленні колькасцю @count у чаканні(@number_applied выкарыстоўваюцца, @number_incompatible прапушчана)

source: @count permissions in use
be: @count дазволаў у выкарыстанні

source: @count posts
be: @count пастоў

source: @count reads
be: @count праглядаў

source: @count sec
be: @count сек.

source: @count translation files imported for the enabled modules.
be: Для задзейнічаных модуляў былі імпартаваны @count файлаў перакладу.

source: @count translation files imported for the newly installed modules.
be: Для толькі што ўсталяваных модуляў былі імпартаваны @count файлаў перакладу.

source: @count translation strings were skipped because they contain disallowed HTML.
be: Радкі перакладу, колькасцю @count , былі прапушчаны, так як яны змяшчаюць забаронены HTML код.

source: @count users have chosen or been assigned to this shortcut set.
be: @count карыстальнікаў абралі або былі падпісаны на гэты набор хуткіх спасылак.

source: @count votes
be: @count галасоў

source: @count weeks
be: @count тыдняў

source: @count years
be: @count гадоў

source: @current of @max
be: @current з @max

source: @driver_name settings
be: наладкі @driver_name

source: @drupal installation complete
be: Інсталяцыя @drupal

source: @field_name (Locked)
be: @field_name (Заблакавана)

source: @module (<span class="admin-disabled">disabled</span>)
be: @module (<span class="admin-disabled">адключаны</span>)

source: @module (<span class="admin-enabled">enabled</span>)
be: @module (<span class="admin-enabled">уключаны</span>)

source: @module (<span class="admin-missing">incompatible with</span> this version of Drupal core)
be: @module (<span class="admin-missing">несумяшчальны з</span> гэтай версіяй ядра Drupal)

source: @module (<span class="admin-missing">incompatible with</span> version @version)
be: @module (<span class="admin-missing">несумяшчальны з</span> версіяй @version)

source: @module (<span class="admin-missing">missing</span>)
be: @module (<span class="admin-missing">адсутнічае</span>)

source: @module administration pages
be: Адміністрацыйная старонка модуля @module

source: @module module
be: @module модуль

source: @name <em>(locked)</em>
be: @name <em>(зачынена)</em>

source: @name requires at least PHP @version.
be: @name патрабуе як мінімум PHP @version.

source: @name requires this module and version. Currently using @required_name version @version
be: @name патрабуе гэты модуль і версію. Зараз выкарыстоўваецца @required_name версіі @version.

source: @name requires this module.
be: @name патрабуе гэты модуль

source: @name's blog
be: Блог @name

source: @node_type comment
be: @node_type каментар

source: @number comments per page
be: @number каментароў на старонку

source: @pass, @fail, @exception, and @debug
be: @pass, @fail, @exception, і @debug

source: @pass, @fail, and @exception
be: @pass, @fail, і @exception

source: @remote could not be saved to @path.
be: @remote нельга захаваць у @path

source: @required_name (Missing)
be: @required_name (Адсутнічае)

source: @required_name (Version @compatibility required)
be: @required_name (Версія @compatibility патрабавана)

source: @shortcut_set shortcuts
be: @shortcut_set хуткіх спасылак

source: @site is currently under maintenance. We should be back shortly. Thank you for your patience.
be: 1 голас@site у рэжыме абслугоўвання. Мы хутка вернемся. Дзякуй за разуменне.

source: @site_name - aggregated feeds
be: @site_name - агрэгаваныя фіды

source: @site_name - aggregated feeds in category @title
be: @site_name - агрэгаваныя фіды ў катэгорыі @title

source: @site_name aggregator
be: Агрэгатар @site_name

source: @size GB
be: @size Гб

source: @size KB
be: @size КБ

source: @size MB
be: @size МБ

source: @time ago
be: @time таму

source: @title dialog
be: @title дыялог

source: @title language provider
be: пастаўшчык мовы @title

source: @type %title has been created.
be: @type %title быў створаны.

source: @type %title has been deleted.
be: @type %title быў выдалены.

source: @type %title has been reverted back to the revision from %revision-date.
be: @type %title быў вернуты назад да версіі, пачынаючы з %revision-date.

source: @type %title has been updated.
be: @type %title быў абноўлены.

source: @type language detection
be: @type вызначэння мовы

source: @type: added %title.
be: @type: дададзены %title.

source: @type: deleted %title revision %revision.
be: @type: выдалены %title з версіі %revision.

source: @type: deleted %title.
be: @type: выдалены %title.

source: @type: reverted %title revision %revision.
be: @type: вернуты %title версіі %revision.

source: @type: updated %title.
be: @type: абноўлены %title.

source: @user's picture
be: @user малюнак карыстальніка

source: A <a href="@aggregator-opml">machine-readable OPML file</a> of all feeds is available. OPML is an XML-based file format used to share outline-structured information such as a list of RSS feeds. Feeds can also be <a href="@import-opml">imported via an OPML file</a>.
be: <a href="@aggregator-opml">Прыдатны для счытвання машынай OPML-файл</a> усіх стужак даступны. OPML з'яўляецца XML-арыентаваным файлавым фарматам, які выкарыстоўваецца для размеркавання структураванай інфармацыі, такой як лістынг RRS стужак. Стужкі таксама могуць быць<a href="@import-opml">імпартаваныя праз OPML-файл</a>.

source: A <a href="@php-code">PHP code</a> text format has been created.
be: Фармат тэксту <a href="@php-code">PHP код</a> быў створаны.

source: A <em>Contact</em> menu item (disabled by default) is added to the Navigation menu, which you can modify on the <a href="@menu-settings">Menus administration page</a>.
be: Пункт меню <em>Звязацца</em> (адключаны па змоўчанні) дададзены ў меню Навігацыя, якое вы можаце змяніць на <a href="@menu-settings">Старонцы адміністравання меню</a>.

source: A <em>forum topic</em> starts a new discussion thread within a forum.
be: <em>Тэма форума</em> пачынае новае дрэва абмеркавання ўнутры форума

source: A <em>poll</em> is a question with a set of possible responses. A <em>poll</em>, once created, automatically provides a simple running count of the number of votes received for each response.
be: <em>Апытанне</em> - гэта пытанне з мноствам магчымых адказаў. Аднойчы створанае <em>апытанне</em> аўтаматычна забяспечвае просты бягучы падлік галасоў, атрыманых для кожнага адказу.

source: A Gettext Portable Object (<em>.po</em>) file.
be: Файл Gettext Portable Object (<em>.po</em>).

source: A basic example: <em>Creating a "Welcome" block that greets visitors with a simple message.</em>
be: Прыклад: <em>Стварэнне "Welcome" блока які вітае наведвальнікаў прастым паведамленнем.</em>

source: A brief description of your block. Used on the <a href="@overview">Blocks administration page</a>.
be: Кароткая характарыстыка вашага блоку. Выкарыстоўваецца на старонцы <a href="@overview">Адміністравання блокаў</a>.

source: A category named %category already exists. Enter a unique title.
be: Катэгорыя %category ужо існуе. Выкарыстайце ўнікальную назву.

source: A category named %category already exists. Please enter a unique title.
be: Катэгорыя %category ужо існуе. Калі ласка, прапануйце іншую назву.

source: A checkbox must be checked by the user.
be: Пераключальнік павінен правярацца карыстальнікам.

source: A confirmation request to cancel your account has been sent to your e-mail address.
be: Пацвярджэнне на выдаленне вашага акаўнта было адпраўлена на ваш e-mail.

source: A contact form with category %category already exists.
be: Кантактная форма з кагэторыяй %category ужо иснуе.

source: A correctly configured <a href="@cron">cron maintenance task</a> is required to update feeds automatically.
be: Правільна наладжаны <a href="@cron">задача абслугоўвання крона</a> патрабуецца для аўтаматычнага абнаўлення фідаў.

source: A date in 'long' format. (%date)
be: Дата ў 'доўгім' фармаце. (%date)

source: A date in 'medium' format. (%date)
be: Дата ў 'сярэднім' фармаце. (%date)

source: A date in 'short' format. (%date)
be: Дата ў 'кароткім' фармаце. (%date)

source: A date in 'time-since' format. (%date)
be: Дата ў фармаце 'time-since'. (%date)

source: A date in UNIX timestamp format (%date)
be: Дата ў фармаце часовай адзнакі UNIX (%date)

source: A date in a custom format. See !php-date for details.
be: Дата ў звычайным фармаце. Глядзіце !php-дату для дэталяў.

source: A feed named %feed already exists. Enter a unique title.
be: Фід с імём %feed ужо існуе. Калі ласка, увядзіце ўнікальную назву.

source: A feed named %feed already exists. Please enter a unique title.
be: Стужка %feed ужо йснуе. Калі ласка, прапануйце іншую назву.

source: A feed named %title already exists.
be: Фід з імем %title ужо існуе.

source: A feed with the URL %url already exists.
be: Фід з адрасам %url ужо існуе.

source: A feed with this URL %url already exists. Enter a unique URL.
be: Фід з гэтым URL %url ужо існуе. Увядзіце калі ласка ўнікальны URL.

source: A field has a <em>label</em> (the name displayed in the user interface) and a <em>machine name</em> (the name used internally). The label can be changed after you create the field, if needed, but the machine name cannot be changed after you have created the field.
be: Кожнае поле мае <em>цэтлік</em> (назва, якая адлюстроўваецца ў інтэрфейсе карыстальніка) і <em>машынную назву</em> (назву для ўнутранага карыстання). Цэтлік можна пры неабходнасці змяніць пасля таго, як вы стварылі поле, але машынную назву нельга змяняць пасля стварэння поля.

source: A flexible, recolorable theme with many regions.
be: Гнуткая тэма з мноствам рэгіёнаў і з магчымасцю змены колераў.

source: A forum holds related forum topics.
be: Форум утрымлівае суадносныя тэмы.

source: A forum topic (and all of its comments) may be moved between forums by selecting a different forum while editing a forum topic. When moving a forum topic between forums, the <em>Leave shadow copy</em> option creates a link in the original forum pointing to the new location.
be: Тэма форума (і ўсе яго каментары) могуць быць перамешчаныя паміж форумамі, выбраўшы іншы форум пры рэдагаванні тэмы форума. Пры перамяшчэнні тэмы форума паміж форумамі, параметр <em>Пакінуць ценявую копію</em> стварае спасылку на арыгінальны форум, указваючы на новае месца.

source: A hidden field cannot be required.
be: Схаванае поле не патрабуецца.

source: A hidden field cannot be set to visible on the user registration form.
be: Схаванае поле не можа быць бачным у рэгістрацыйнай форме карыстальніка.

source: A list field (@field_name) with existing data cannot have its keys changed.
be: Спіс палёў (@ імя_палі) з наяўнымі дадзенымі не можа існаваць. Яго ключы змяніліся.

source: A list of HTML tags that can be used. JavaScript event attributes, JavaScript URLs, and CSS are always stripped.
be: Спіс HTML тэгаў, які можа ўжывацца. JavaScript атрыбуты падзеі, JavaScript URLы, і CSS заўседы выдаляюцца.

source: A list of all options. Put each option on a separate line. Example options are "red", "blue", "green", etc.
be: Спіс усіх варыянтаў. Пазначце па адным варыянце на радок. Напрыклад: "чырвоны", "блакітны", "васільковы".

source: A local file system path where public files will be stored. This directory must exist and be writable by Drupal. This directory must be relative to the Drupal installation directory and be accessible over the web.
be: Лакальны сістэмны файлавы шлях для агульнадаступных файлаў будзе захаваны. Гэты каталог павінен існаваць і быць запісваемы для Drupal. Таксама гэты каталог павінен быць ва унутраным каталогу Drupal і дасяжны праз вэб.

source: A local file system path where temporary files will be stored. This directory should not be accessible over the web.
be: Лакальны сістэмны файлавы шлях для часовых файлаў будзе захаваны. Гэты каталог не павінен быць даступны праз вэб.

source: A multi-column theme which can be configured to modify colors and switch between fixed and fluid width layouts.
be: Многаслупковая тэма, якая можа быть наладжана са змяненем колераў і пераключацца паміж усталяванай разметкай і разметкай з рухомай шырынёй

source: A new address has been generated.
be: Новы адрас быў створаны.

source: A path alias set for a specific language will always be used when displaying this page in that language, and takes precedence over path aliases set for <em>All languages</em>.
be: Шлях псеўданіма, устаноўлены для канкрэтнай мовы, заўсёды будзе выкарыстоўвацца пры адлюстраванні гэтай старонкі на гэтай мове, і мае прыярытэт над шляхам псеўданімаў, устаноўленых для <em> Усе мовы </em>.

source: A report of <a href="@update-report">available updates</a> will alert you when new releases are available for download. You may configure options for the frequency for checking updates (which are performed during <a href="@cron">cron</a> runs) and e-mail notifications at the <a href="@update-settings">Update manager settings</a> page.
be: Справаздача аб <a href="@update-report">даступных абнаўленнях</a> будзе паведамляць вам, калі новыя рэлізы стануць даступныя для закачкі. Вы можаце наладзіць опцыі частаты праверкі наяўнасці абнаўленняў (якія выявяцца падчас працы крона <a href="@cron">крона</a>) і e-mail паведамленняў на старонцы наладак <a href="@update-settings">Update manager</a>.

source: A simple one-column, tableless, fluid width administration theme.
be: Простая аднаслупковая, таблічная, з гнуткай шырынёй тэма адміністравання

source: A space-separated list of HTML tags allowed in the content of feed items. Disallowed tags are stripped from the content.
be: Падзелены прабеламі спіс HTML-тэгаў, якія дазволеныя ў элементах фіда. Забароненыя тэгі выдаляюцца з кантэнту.

source: A string that will be prepended to every message logged to Syslog. If you have multiple sites logging to the same Syslog log file, a unique identity per site makes it easy to tell the log entries apart.
be: Радок, які будзе ўстаўлены ў кожнае паведамленне модуля Syslog. Калі вы маеце шматсайтавую інсталяцыю Syslog жарналіруе ўсё ў адзін файл. Унікальная адзнака кожнага сайта дапаможа разумець адкуль прыйшло паведамленне.

source: A text format contains filters that change the user input, for example stripping out malicious HTML or making URLs clickable. Filters are executed from top to bottom and the order is important, since one filter may prevent another filter from doing its job. For example, when URLs are converted into links before disallowed HTML tags are removed, all links may be removed. When this happens, the order of filters may need to be re-arranged.
be: Тэкставы фармат утрымлівае фільтры, якія змяняюць уводзімыя карыстальнікам дадзеныя, напрыклад, выдаляюць злосны HTML альбо робяць URL'ы клікабельнымі. Фільтры выконваюцца зверху ўніз, і парадак важны пры гэтым, паколькі адзін фільтр можа перашкодзіць іншаму рабіць сваю працу. Напрыклад, калі канверсаваць URL'ы ў спасылкі перад тым, як будуць выдалены забароненыя тэгі HTML, то тады ўсе спасылкі могуць быць выдалены. У гэтым выпадку можа спатрэбіцца пераўпарадкаваць паслядоўнасць фільтраў.

source: A translation of %title in %language already exists, a new %type will be created instead of a translation.
be: Пераклад %title на %language ужо існуе, замест перакладу будзе створаны новы %type.

source: A unique label for this advanced action. This label will be displayed in the interface of modules that integrate with actions, such as Trigger module.
be: Унікальны цэтлік для пашыраных дзеянняў. Гэты цэтлік будзе адлюстроўвацца ў інтэрфейсе модуляў, якія інтэгруюцца з дзеяннямі, напрыклад, модуль Trigger.

source: A unique machine-readable name containing letters, numbers, and underscores.
be: Унікальнае машыначытальнае імя, якое змяшчае літары, лічбы і знак падкрэслення.

source: A unique machine-readable name for this content type. It must only contain lowercase letters, numbers, and underscores. This name will be used for constructing the URL of the %node-add page, in which underscores will be converted into hyphens.
be: Унікальнае імя для гэтага тыпу змесціва, для счытваемае машынай. Яно павінна ўтрымліваць толькі маленькія літары, лічбы і падкрэсліванні. Гэта імя будзе выкарыстана для будавання URL %node-даданай старонкі, у якой падкрэсліванні будуць сканверсаваны ў злучкі.
